// ========================================================================
// 文件名：validate.js
//
// 文件说明：
//     本文件主要实现权限模块中页面的输入验证，包括添加角色、修改角色、添加
// 权限和修改权限。
// 
// 历史记录：
// 2010-01-28  周中坚  创建文件，完成基本功能。
// 2010-02-25  周中坚  添加注释。
// 2012-02-14  冯成林 修改文件。
// ========================================================================

$(document).ready(function(){
	$("#form_role").validate({
		event: "blur",
		rules:{
			"role.name":{required:true,maxlength:20},
			"role.description":{required:true,maxlength:200}
		}
	});
});